kateloop/453-project/PIC18/code/main.c
    // int led_array[13];
    // R5, L5, R4, L4, R3, L3, C, D, E, F, G, A, B

    // toggle octave 5 leds
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[0] = 1;
        led_array[1] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[0] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[1] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }

    // toggle octave 4 leds
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[2] = 1;
        led_array[3] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[2] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[3] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }

    // toggle octave 3 LEDs
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[4] = 1;
        led_array[5] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    // toggle octave 3 LEDs
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[4] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);

    }
    // toggle octave 3 LEDs
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[5] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
}

// ISR that processes ADC data from 7 inputs in a sequential fashion

void interrupt my_isr(void) {
    // Disable Interrupts
    INTCON &= 0b01111111;   // disables interrupts

    if (TMR0IE && TMR0IF && TMR0IP) {
        adc_conversion ();

       if (conv_result.adc_channel == ADCCHANA) {
            if ((chanA[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
                
            }
            chanA[0] = conv_result.result;
        } else if (conv_result.adc_channel == ADCCHANB) {
            if ((chanB[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
            
            }
            chanB[0] = conv_result.result;
        } else if (conv_result.adc_channel == ADCCHANC) {
            if ((chanC[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
              
            }
            chanC[0] = conv_result.result;
        } else if (conv_result.adc_channel == ADCCHAND) {
            if ((chanD[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
              
            }
            chanD[0] = conv_result.result;
        } else if (conv_result.adc_channel == ADCCHANE) {
            if ((chanE[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
              
            }
            chanE[0] = conv_result.result;
        } else if (conv_result.adc_channel == ADCCHANF) {
            if ((chanF[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
            }
            chanF[0] = conv_result.result;
        } else if (conv_result.adc_channel == ADCCHANG) {
            if ((chanG[0] & conv_result.result) == conv_result.result) {
                TXREG = conv_result.result;
                while((PIR1 & 0b00010000) == 0);
                ToggleLeds();
            } else {
                
            }
            chanG[0] = conv_result.result;
        }
        // Clear flag for timer 0
        TMR0IF = 0;
    }

    // Reenable Interrupts
    INTCON |= 0b10000000;   // enables interrupts

}


//////////////////////////////////////////////
// Function that processes ADC data from    //
// 7 inputs in a sequential fashion         //
//////////////////////////////////////////////

void adc_conversion() {

    ADON = 0;   // Turn off ADC

    ADRESH = 0; // reset result registers
    ADRESL = 0;

    // set ADCON0 register, start conversion, write result in new
    switch (adc_num) {
        case ADCCHANA :
            ADCON0 = ADCON0_CHANA;
            break;
        case ADCCHANB :
            ADCON0 = ADCON0_CHANB;
            break;
        case ADCCHANC :
            ADCON0 = ADCON0_CHANC;
            break;
        case ADCCHAND :
            ADCON0 = ADCON0_CHAND;
            break;
        case ADCCHANE :
            ADCON0 = ADCON0_CHANE;
            break;
        case ADCCHANF :
            ADCON0 = ADCON0_CHANF;
            break;
        case ADCCHANG :
            ADCON0 = ADCON0_CHANG;
            break;
    }


