kateloop/453-project/PIC18/code/main.c
    // Start conversion and wait for result
    ADON = 1;   // Turn on ADC
    GODONE = 1; // Starts conversion

    // Wait for conversion to finish
    while (GODONE);
    unsigned char hResult = ADRESH;
    unsigned char lResult = ADRESL;
    unsigned char note = getNote(hResult, lResult);

    // store conversion result
    conv_result.result = note;
    conv_result.adc_channel = adc_num;

    // Increase the number of the ADC for next conversion
    adc_num++;
    if (adc_num >= NUMADCCHAN) {
        adc_num = ADCCHANA;
    }
}


/////////////////////////////////////////
//   Function that determines note
//   to be played and data to send
//   across UART
///////////////////////////////////////////
unsigned char getNote (unsigned char hResult, unsigned char lResult) {
    unsigned char new_note;

    if (adc_num == ADCCHANA) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 190 && lResult <= 210) {
                // 5AF
                new_note = 0x51;
            } else if (lResult >= 195 && lResult <= 216) {
                // 5A
                new_note = 0x41;
            } else if (lResult >= 128 && lResult <= 154) {
                // 5AS
                new_note = 0x49;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 222 && lResult <= 252) {
                // 4AF
                new_note = 0x31;
            } else if (lResult >= 105 && lResult <= 175) {
                // 4A
                new_note = 0x21;
            } else if (lResult >= 105 && lResult <= 148) {
                // 4AS
                new_note = 0x29;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 15 && lResult <= 108) {
                // 3AF
                new_note = 0x11;
            } else if (lResult >= 116 && lResult <= 183) {
                // 3A
                new_note = 0x01;
            } else if (lResult >= 192 && lResult <= 227) {
                // 3AS
                new_note = 0x09;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHANB) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;
        } else if (hResult == 0x01) {
            if (lResult >= 187 && lResult <= 213) {
                // 5BF
                new_note = 0x52;
            } else if (lResult >= 161 && lResult <= 182) {
                // 5B
                new_note = 0x42;
            } else if (lResult >= 120 && lResult <= 150) {
                // 5BS
                new_note = 0x4a;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 206 && lResult <= 232) {
                // 4BF
                new_note = 0x32;
            } else if (lResult >= 165 && lResult <= 238) {
                // 4B
                new_note = 0x22;
            } else if (lResult >= 109 && lResult <= 140) {
                // 4BS
                new_note = 0x2a;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0 && lResult <= 174) {
                // 3BF
                new_note = 0x12;
            } else if (lResult >= 193 && lResult <= 210) {
                // 3B
                new_note = 0x02;
            } else if (lResult >= 221 && lResult <= 229) {
                // 3BS
                new_note = 0x0a;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHANC) {
        if (hResult == 0x00) {
           // No note playing
           new_note = 0x00;
        } else if (hResult == 0x01) {
           if (lResult >= 218 && lResult <= 242) {
               // 5CF
               new_note = 0x53;
           } else if (lResult >= 167 && lResult <= 200) {
                // 5C
                new_note = 0x43;
           } else if (lResult >= 38 && lResult <= 160) {
                // 5CS
                new_note = 0x4b;
           } else {
                // no note playing
                new_note = 0x00;
           }

        } else if (hResult == 0x02) {
            if (lResult >= 201 && lResult <= 235) {
                // 4CF
                new_note = 0x33;
            } else if (lResult >= 124 && lResult <= 183) {
                // 4C
                new_note = 0x23;
            } else if (lResult >= 70 && lResult <= 110) {
                // 4CS
                new_note = 0x2b;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 60 && lResult <= 87) {
                // 3CF
                new_note = 0x13;
            } else if (lResult >= 138 && lResult <= 200) {
                // 3C
                new_note = 0x03;
            } else if (lResult >= 212 && lResult <= 232) {
                // 3CS
                new_note = 0x0b;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHAND) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 200 && lResult <= 230) {
                // 5DF
                new_note = 0x54;
            } else if (lResult >= 130 && lResult <= 180) {
                // 5D
                new_note = 0x44;
            } else if (lResult >= 90 && lResult <= 120) {
                // 5DS
                new_note = 0x4c;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 203 && lResult <= 255) {
                // 4DF
                new_note = 0x34;
            } else if (lResult >= 130 && lResult <= 167) {
                // 4D
                new_note = 0x24;
            } else if (lResult >= 87 && lResult <= 124) {
                // 4DS
                new_note = 0x2c;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 60 && lResult <= 160) {
                // 3DF
                new_note = 0x14;
            } else if (lResult >= 145 && lResult <= 205) {
                // 3D
                new_note = 0x04;
            } else if (lResult >= 227 && lResult <= 239) {
                // 3DS
                new_note = 0x0c;
            } else {
                // no note playing
                new_note = 0x00;
            }

